sebistoecklin/Energia/hardware/msp430/variants/SEAMWiT_ReaderUnit_v2/pins_energia.h
/*
  ************************************************************************
  *	pins_energia.h
  *
  *	Pin definition functions for FraunchPad
  *		Copyright (c) 2012 Robert Wessels. All right reserved.
  *
  *     Contribution: Stefan Sch
  *
  ***********************************************************************
  Derived from:
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/

#ifndef Pins_Energia_h
#define Pins_Energia_h
#ifndef BV
#define BV(x) (1 << (x))
#endif

#if defined(__MSP430_HAS_EUSCI_B0__)
static const uint8_t SS      = 22;  /* P2.1 - only external CS when working as master, real SS not connected */
static const uint8_t SCK     = 21;  /* P2.2 */
static const uint8_t MOSI    = 26;  /* P1.6 aka SIMO */
static const uint8_t MISO    = 27;  /* P1.7 aka SOMI */
static const uint8_t TWISDA  = 26;  /* P1.6 */
static const uint8_t TWISCL  = 27;  /* P1.7 */
#define TWISDA_SET_MODE  (PORT_SELECTION1 | INPUT_PULLUP)
#define TWISCL_SET_MODE  (PORT_SELECTION1 | INPUT_PULLUP)
#endif

#if defined(__MSP430_HAS_EUSCI_A0__)
static const uint8_t DEBUG_UARTRXD = 20;  /* Receive  Data (RXD) at P2.1 */
static const uint8_t DEBUG_UARTTXD = 19;  /* Transmit Data (TXD) at P2.0 */
#define DEBUG_UARTRXD_SET_MODE (PORT_SELECTION1 | INPUT)
#define DEBUG_UARTTXD_SET_MODE (PORT_SELECTION1 | OUTPUT)
#define DEBUG_UART_MODULE_OFFSET 0x00
#endif

/* Analog pins */
/* Note: In contrast to other Energia pin mappings, the Ax names correspond to those of the datasheet */

static const uint8_t A0   = 1;   /* 1 - P1.0 */
static const uint8_t A1   = 2;   /* 2 - P1.1 */
static const uint8_t A2   = 3;   /* 3 - P1.2 */
static const uint8_t A3   = 8;   /* 8 - P1.3 */
static const uint8_t A4   = 9;   /* 9 - P1.4 */
static const uint8_t A5   = 10;  /* 10 - P1.5 */
static const uint8_t A6   = 28;  /* 28 - P2.3 */
static const uint8_t A7   = 29;  /* 29 - P2.4 */
static const uint8_t A12  = 4;   /* 4 - P3.0 */
static const uint8_t A13  = 5;   /* 5 - P3.1 */
static const uint8_t A14  = 6;   /* 6 - P3.2 */
static const uint8_t A15  = 7;   /* 5 - P3.3 */

// still there from Fraunchpad pin mapping (maybe there is a need for a change):
//static const uint8_t A10 = 128 + 10; //Special this is device's internal temp sensor */
//static const uint8_t A11 = 128 + 11; //Special this is Vcc/2 */


/* Addtional special pin functions (corresponding to schematic names, not including SPI & UART pins => see above) */

static const uint8_t VcoilSlow 	 	 =  1;		/* 1 - P1.0 */
static const uint8_t Cap1 		 	 =  2;		/* 2 - P1.1 */
static const uint8_t Cap2 		 	 =  3;		/* 3 - P1.2 */
static const uint8_t Cap3 		 	 =  4;		/* 4 - P3.0 */
static const uint8_t Cap4 		 	 =  5;		/* 5 - P3.1 */
static const uint8_t Cap5 			 =  6;		/* 6 - P3.2 */
static const uint8_t Cap6 			 =  7;		/* 7 - P3.3 */
static const uint8_t VampMeas 		 =  8;		/* 8 - P1.3 */
static const uint8_t VbatMeas 		 =  9;		/* 9 - P1.4 */
static const uint8_t Vzc 			 = 10;		/* 10 - P1.5 */
static const uint8_t R1 			 = 11;		/* 11 - PJ.0 */
static const uint8_t R2 			 = 12;		/* 12 - PJ.1 */
static const uint8_t R3 			 = 13;		/* 13 - PJ.2 */
static const uint8_t R4 			 = 14;		/* 14 - PJ.3 */
static const uint8_t R5 			 = 15;		/* 15 - P4.0 */
static const uint8_t R6 			 = 16;		/* 16 - P4.1 */
static const uint8_t BuckEnable 	 = 17;		/* 17 - P2.5 */
static const uint8_t LDOEnable 		 = 18;		/* 18 - P2.6 */

static const uint8_t PWM 			 = 22;		/* 22 - P3.4 */
static const uint8_t ClippingControl = 23;		/* 23 - P3.5 */
static const uint8_t CCEnable 		 = 24;		/* 24 - P3.6 */
static const uint8_t DownlinkCS 	 = 25;		/* 25 - P3.7 */

static const uint8_t SlicedData 	 = 28;		/* 28 - P2.3 */
static const uint8_t VDDdata 		 = 29;		/* 29 - P2.4 */	
static const uint8_t LED1 			 = 30;		/* 30 - PJ.4 */
static const uint8_t LED2 			 = 31;		/* 31 - PJ.5 */


/* Pin names based on the TI port and pin names */

static const uint8_t P1_0 =  1;		/*  1 - P1.0 */
static const uint8_t P1_1 =  2;		/*  2 - P1.1 */
static const uint8_t P1_2 =  3;		/*  3 - P1.2 */
static const uint8_t P3_0 =  4;		/*  4 - P3.0 */
static const uint8_t P3_1 =  5;		/*  5 - P3.1 */
static const uint8_t P3_2 =  6;		/*  6 - P3.2 */
static const uint8_t P3_3 =  7;		/*  7 - P3.3 */
static const uint8_t P1_3 =  8;		/*  8 - P1.3 */
static const uint8_t P1_4 =  9;		/*  9 - P1.4 */
static const uint8_t P1_5 = 10;		/* 10 - P1.5 */
static const uint8_t PJ_0 = 11;		/* 11 - PJ.0 */
static const uint8_t PJ_1 = 12;		/* 12 - PJ.1 */
static const uint8_t PJ_2 = 13;		/* 13 - PJ.2 */
static const uint8_t PJ_3 = 14;		/* 14 - PJ.3 */
static const uint8_t P4_0 = 15;		/* 15 - P4.0 */
static const uint8_t P4_1 = 16;		/* 16 - P4.1 */
static const uint8_t P2_5 = 17;		/* 17 - P2.5 */
static const uint8_t P2_6 = 18;		/* 18 - P2.6 */
static const uint8_t P2_0 = 19;		/* 19 - P2.0 */
static const uint8_t P2_1 = 20;		/* 20 - P2.1 */
static const uint8_t P2_2 = 21;		/* 21 - P2.2 */
static const uint8_t P3_4 = 22;		/* 22 - P3.4 */
static const uint8_t P3_5 = 23;		/* 23 - P3.5 */
static const uint8_t P3_6 = 24;		/* 24 - P3.6 */
static const uint8_t P3_7 = 25;		/* 25 - P3.7 */
static const uint8_t P1_6 = 26;		/* 26 - P1.6 */
static const uint8_t P1_7 = 27;		/* 27 - P1.7 */
static const uint8_t P2_3 = 28;		/* 28 - P2.3 */
static const uint8_t P2_4 = 29;		/* 29 - P2.4 */	
static const uint8_t PJ_4 = 30;		/* 30 - PJ.4 */
static const uint8_t PJ_5 = 31;		/* 31 - PJ.5 */


/* For LaunchPad compatability */
static const uint8_t TEMPSENSOR = 128 + 10;

#ifdef ARDUINO_MAIN

const uint16_t port_to_input[] = {
	NOT_A_PORT,
	(uint16_t) &P1IN,
	(uint16_t) &P2IN,
#ifdef __MSP430_HAS_PORT3_R__
	(uint16_t) &P3IN,
#endif
#ifdef __MSP430_HAS_PORT4_R__
	(uint16_t) &P4IN,
#endif
#ifdef __MSP430_HAS_PORTJ_R__
	(uint16_t) &PJIN,
#endif
};

const uint16_t port_to_output[] = {
	NOT_A_PORT,
	(uint16_t) &P1OUT,
	(uint16_t) &P2OUT,
#ifdef __MSP430_HAS_PORT3_R__
	(uint16_t) &P3OUT,
#endif
#ifdef __MSP430_HAS_PORT4_R__
	(uint16_t) &P4OUT,
#endif
#ifdef __MSP430_HAS_PORTJ_R__
	(uint16_t) &PJOUT,
#endif
};

const uint16_t port_to_dir[] = {
	NOT_A_PORT,
	(uint16_t) &P1DIR,
	(uint16_t) &P2DIR,
#ifdef __MSP430_HAS_PORT3_R__
	(uint16_t) &P3DIR,
#endif
#ifdef __MSP430_HAS_PORT4_R__
	(uint16_t) &P4DIR,
#endif
#ifdef __MSP430_HAS_PORTJ_R__
	(uint16_t) &PJDIR,
#endif
};

const uint16_t port_to_ren[] = {
	NOT_A_PORT,
	(uint16_t) &P1REN,
	(uint16_t) &P2REN,
#ifdef __MSP430_HAS_PORT3_R__
	(uint16_t) &P3REN,
#endif
#ifdef __MSP430_HAS_PORT4_R__
	(uint16_t) &P4REN,
#endif
#ifdef __MSP430_HAS_PORTJ_R__
	(uint16_t) &PJREN,
#endif
};

const uint16_t port_to_sel0[] = {
	NOT_A_PORT,
	(uint16_t) &P1SEL0,
	(uint16_t) &P2SEL0,
#ifdef __MSP430_HAS_PORT3_R__
	(uint16_t) &P3SEL0,
#endif
#ifdef __MSP430_HAS_PORT4_R__
	(uint16_t) &P4SEL0,
#endif
#ifdef __MSP430_HAS_PORTJ_R__
	(uint16_t) &PJSEL0,
#endif
};

const uint16_t port_to_sel1[] = {
	NOT_A_PORT,
	(uint16_t) &P1SEL1,
	(uint16_t) &P2SEL1,
#ifdef __MSP430_HAS_PORT3_R__
	(uint16_t) &P3SEL1,
#endif
#ifdef __MSP430_HAS_PORT4_R__
	(uint16_t) &P4SEL1,
#endif
#ifdef __MSP430_HAS_PORTJ_R__
	(uint16_t) &PJSEL1,
#endif
};

const uint8_t digital_pin_to_timer[] = {
	NOT_ON_TIMER,   /*  0 - pin count starts at 1 */
	T0A1,			/*  1 - P1.0 */
	T0A2,			/*  2 - P1.1 */
	T1A1,			/*  3 - P1.2 */
	NOT_ON_TIMER,	/*  4 - P3.0 */
	NOT_ON_TIMER,	/*  5 - P3.1 */
	NOT_ON_TIMER,	/*  6 - P3.2 */
	NOT_ON_TIMER,	/*  7 - P3.3 */
	T1A2,			/*  8 - P1.3 */
	T0B1,			/*  9 - P1.4 */
	T0B2,			/* 10 - P1.5 */
	NOT_ON_TIMER,	/* 11 - PJ.0 */
	NOT_ON_TIMER,	/* 12 - PJ.1 */
	NOT_ON_TIMER,	/* 13 - PJ.2 */
	NOT_ON_TIMER,	/* 14 - PJ.3 */
	NOT_ON_TIMER,	/* 15 - P4.0 */
	NOT_ON_TIMER,	/* 16 - P4.1 */
	T0B0,			/* 17 - P2.5 */
	T1B0,			/* 18 - P2.6 */
	T2B0,			/* 19 - P2.0 */
	T2B1,			/* 20 - P2.1 */
	T2B2,			/* 21 - P2.2 */
	T1B1,			/* 22 - P3.4 */
	T1B2,			/* 23 - P3.5 */
	T2B1,			/* 24 - P3.6 */
	T2B2,			/* 25 - P3.7 */
	T1B1,			/* 26 - P1.6 */
	T1B2,			/* 27 - P1.7 */
	T0A0,			/* 28 - P2.3 */
	T1A0,			/* 29 - P2.4 */	
	NOT_ON_TIMER,	/* 30 - PJ.4 */
	NOT_ON_TIMER,	/* 31 - PJ.5 */

};

const uint8_t digital_pin_to_port[] = {
	NOT_A_PIN,   /*  0 - pin count starts at 1 */
	P1,			/*  1 - P1.0 */
	P1,			/*  2 - P1.1 */
	P1,			/*  3 - P1.2 */
	P3,			/*  4 - P3.0 */
	P3,			/*  5 - P3.1 */
	P3,			/*  6 - P3.2 */
	P3,			/*  7 - P3.3 */
	P1,			/*  8 - P1.3 */
	P1,			/*  9 - P1.4 */
	P1,			/* 10 - P1.5 */
	PJ,			/* 11 - PJ.0 */
	PJ,			/* 12 - PJ.1 */
	PJ,			/* 13 - PJ.2 */
	PJ,			/* 14 - PJ.3 */
	P4,			/* 15 - P4.0 */
	P4,			/* 16 - P4.1 */
	P2,			/* 17 - P2.5 */
	P2,			/* 18 - P2.6 */
	P2,			/* 19 - P2.0 */
	P2,			/* 20 - P2.1 */
	P2,			/* 21 - P2.2 */
	P3,			/* 22 - P3.4 */
	P3,			/* 23 - P3.5 */
	P3,			/* 24 - P3.6 */
	P3,			/* 25 - P3.7 */
	P1,			/* 26 - P1.6 */
	P1,			/* 27 - P1.7 */
	P2,			/* 28 - P2.3 */
	P2,			/* 29 - P2.4 */	
	PJ,			/* 30 - PJ.4 */
	PJ,			/* 31 - PJ.5 */

};

const uint8_t digital_pin_to_bit_mask[] = {
	NOT_A_PIN,  /*  0 - pin count starts at 1 */
	BV(0),		/*  1 - P1.0 */
	BV(1),		/*  2 - P1.1 */
	BV(2),		/*  3 - P1.2 */
	BV(0),		/*  4 - P3.0 */
	BV(1),		/*  5 - P3.1 */
	BV(2),		/*  6 - P3.2 */
	BV(3),		/*  7 - P3.3 */
	BV(3),		/*  8 - P1.3 */
	BV(4),		/*  9 - P1.4 */
	BV(5),		/* 10 - P1.5 */
	BV(0),		/* 11 - PJ.0 */
	BV(1),		/* 12 - PJ.1 */
	BV(2),		/* 13 - PJ.2 */
	BV(3),		/* 14 - PJ.3 */
	BV(0),		/* 15 - P4.0 */
	BV(1),		/* 16 - P4.1 */
	BV(5),		/* 17 - P2.5 */
	BV(6),		/* 18 - P2.6 */
	BV(0),		/* 19 - P2.0 */
	BV(1),		/* 20 - P2.1 */
	BV(2),		/* 21 - P2.2 */
	BV(4),		/* 22 - P3.4 */
	BV(5),		/* 23 - P3.5 */
	BV(6),		/* 24 - P3.6 */
	BV(7),		/* 25 - P3.7 */
	BV(6),		/* 26 - P1.6 */
	BV(7),		/* 27 - P1.7 */
	BV(3),		/* 28 - P2.3 */
	BV(4),		/* 29 - P2.4 */	
	BV(4),		/* 30 - PJ.4 */
	BV(5),		/* 31 - PJ.5 */

};

const uint32_t digital_pin_to_analog_in[] = {
	NOT_ON_ADC,  /*  0 - pin count starts at 1 */
	0			 /*  1 - P1.0 */
	1,			 /*  2 - P1.1 */
	2,			 /*  3 - P1.2 */
	12,			 /*  4 - P3.0 */
	13,		 	 /*  5 - P3.1 */
	14,			 /*  6 - P3.2 */
	15,			 /*  7 - P3.3 */
	3,			 /*  8 - P1.3 */
	4,			 /*  9 - P1.4 */
	5,			 /* 10 - P1.5 */
	NOT_ON_ADC,	 /* 11 - PJ.0 */
	NOT_ON_ADC,  /* 12 - PJ.1 */
	NOT_ON_ADC,	 /* 13 - PJ.2 */
	NOT_ON_ADC,	 /* 14 - PJ.3 */
	NOT_ON_ADC,	 /* 15 - P4.0 */
	NOT_ON_ADC,	 /* 16 - P4.1 */
	NOT_ON_ADC,	 /* 17 - P2.5 */
	NOT_ON_ADC,	 /* 18 - P2.6 */
	NOT_ON_ADC,	 /* 19 - P2.0 */
	NOT_ON_ADC,	 /* 20 - P2.1 */
	NOT_ON_ADC,	 /* 21 - P2.2 */
	NOT_ON_ADC,	 /* 22 - P3.4 */
	NOT_ON_ADC,	 /* 23 - P3.5 */
	NOT_ON_ADC,	 /* 24 - P3.6 */
	NOT_ON_ADC,	 /* 25 - P3.7 */
	NOT_ON_ADC,	 /* 26 - P1.6 */
	NOT_ON_ADC,	 /* 27 - P1.7 */
	6,			 /* 28 - P2.3 */
	7,			 /* 29 - P2.4 */	
	NOT_ON_ADC,	 /* 30 - PJ.4 */
	NOT_ON_ADC	 /* 31 - PJ.5 */
};
#endif
#endif
